In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("retail_sales_dataset.csv")

In [3]:
df

   product_id category  price  quantity_sold  discount_percent
0         101    Shirt   1200             50                10
1         102    Jeans   2500             40                15
2         103   Jacket   4000             20                 5
3         104    Shirt   1500             60                 0
4         105    Jeans   2700             35                20
5         106   Jacket   4200             25                10
6         107    Shirt   1300             55                 5
7         108    Jeans   2600             45                15

In [4]:
df.shape

(8, 5)

In [5]:
df.describe()

       product_id        price  quantity_sold  discount_percent
count     8.00000     8.000000        8.00000          8.000000
mean    104.50000  2500.000000       41.25000         10.000000
std       2.44949  1153.875458       14.07886          6.546537
min     101.00000  1200.000000       20.00000          0.000000
25%     102.75000  1450.000000       32.50000          5.000000
50%     104.50000  2550.000000       42.50000         10.000000
75%     106.25000  3025.000000       51.25000         15.000000
max     108.00000  4200.000000       60.00000         20.000000

In [16]:
df["revenue"] = df["price"] * df["quantity_sold"]

In [10]:
df

   product_id category  price  quantity_sold  discount_percent  revenue
0         101    Shirt   1200             50                10    60000
1         102    Jeans   2500             40                15   100000
2         103   Jacket   4000             20                 5    80000
3         104    Shirt   1500             60                 0    90000
4         105    Jeans   2700             35                20    94500
5         106   Jacket   4200             25                10   105000
6         107    Shirt   1300             55                 5    71500
7         108    Jeans   2600             45                15   117000

In [11]:
df['final_revenue'] = df['revenue'] - (df['revenue'] * df['discount_percent'] / 100)

In [12]:
df

,product_id,category,price,quantity_sold,discount_percent,revenue,final_revenue
0,101,Shirt,1200,50,10,60000,54000.0
1,102,Jeans,2500,40,15,100000,85000.0
2,103,Jacket,4000,20,5,80000,76000.0
3,104,Shirt,1500,60,0,90000,90000.0
4,105,Jeans,2700,35,20,94500,75600.0
5,106,Jacket,4200,25,10,105000,94500.0
6,107,Shirt,1300,55,5,71500,67925.0
7,108,Jeans,2600,45,15,117000,99450.0

In [17]:
result = (
    df
    .groupby("category", as_index=False)
    .agg(total_final_revenue=("final_revenue", "sum"))
)

result

  category  total_final_revenue
0   Jacket             170500.0
1    Jeans             260050.0
2    Shirt             211925.0